//Напишите программу, которая принимает на вход целое число и выдает его квадрат
Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

int sqrNumber = number * number;
Console.WriteLine($"Квадрат вашего числа = {sqrNumber}");

